In [1]:
import pandas as pd

In [2]:
pd.concat?

* 실습

In [3]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])

In [4]:
# 기본적으로 ignore_index=False 임

pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [6]:
# index 가 무시되고 새롭게 부여됨

pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [9]:
# keys 값과 ignore_index는 같이 쓰면 의미가 없음

pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [10]:
pd.concat([s1, s2], keys=['s1', 's2'], names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [12]:
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [13]:
# df2 생성

df2 = pd.DataFrame([['c', 3], ['d', 4]],columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [14]:
pd.concat([df1,df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [15]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [16]:
# 형태가 다른 프레임 합치기

pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [17]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [18]:
# join 값 속성 부여 : inner : 앞에 선언된 df 기준

pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [19]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [20]:
# axis : 어느 축 기준으로 붙일 것인가?

pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [22]:
df5 = pd.DataFrame([1], index=['a'])
df5

   0
a  1

In [23]:
df6 = pd.DataFrame([2], index=['a'])
df6

   0
a  2

In [24]:
# 동일한 인덱스를 가지고 있더라도 

pd.concat([df5, df6])

   0
a  1
a  2

In [26]:
# verify_integrity 를 옵션으로 주면 동일한 인덱스 명이라고 에러 메시지가 나옴
# 검증용으로 사용

pd.concat([df5, df6], verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

In [2]:
l1 = {
    "name": ["John", "Nate", "Fred"],
    "job": ["teacher", "student", "developer"]
}
l2 = {
    "name": ["Ed", "Jack", "Ted"],
    "job": ["dentist", "farmer", "designer"]
}
l3 = {
    "name": ["John", "Nate", "Fred"],
    "job": ["teacher", "student", "developer"]
}
l4 = {
    "age": [25, 30, 45],
    "country": ["U.S", "U.K", "Korea"]
}

df1 = pd.DataFrame(l1)
df2 = pd.DataFrame(l2)

In [3]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [4]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

#### df1, df2 합치기 - 열로

In [5]:
# 첫번째 방법

result = pd.concat([df1, df2])
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [6]:
# 위에서 문제는 인덱스가 중복으로 들어감 - 변경

result = pd.concat([df1, df2], ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [7]:
# 두 번째 방법

result = df1.append(df2)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [8]:
# index 중복 해제

result = df1.append(df2, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

#### df1, df2 합치기 - 행으로

In [9]:
df3 = pd.DataFrame(l3)
df4 = pd.DataFrame(l4)

In [10]:
df3

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [11]:
df4

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [13]:
result = pd.concat([df3, df4], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Fred  developer  45  Korea

#### 리스트 합치기

In [14]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [15]:
comparison = pd.DataFrame({"label":label, "prddiction":prediction})
comparison

   label  prddiction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4